Revit 2027 API
ParameterTypeId.ForegroundPatternColorParam Property
 "Foreground Pattern Color"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ForegroundPatternColorParam { get; }
Public Shared ReadOnly Property ForegroundPatternColorParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ForegroundPatternColorParam {
	ForgeTypeId^ get ();
}
static member ForegroundPatternColorParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace